CodeIgniter/app/Controllers/BlocosDeletar.php

    public function index()
    {
        $blocoModel = new \App\Models\BlocoModel();
        $data['blocos'] = $blocoModel->findAll(); // Busca todas as salas
---
SELECT *
FROM `Bloco`