CodeIgniter/app/Controllers/BlocosExibir.php

SELECT *
FROM `Bloco`
---
    public function index()
    {
        $blocoModel = new \App\Models\BlocoModel();
        $data['blocos'] = $blocoModel->findAll(); // Busca todas as salas