CodeIgniter/app/Controllers/Blocos.php

    public function inserir()
    {
        $data['titulo'] = 'Inserir nova sala';
        $data['acao'] = 'Inserir';
        $data['msg'] = ''; // Initializes the $msg variable

        if ($this->request->getMethod() === 'post') {
            $blocoModel = new \App\Models\BlocoModel();

            // Retrieving POST data
            $nome = $this->request->getPost('nome');
            $lugares = $this->request->getPost('lugares');
            $computadores = $this->request->getPost('computadores');

            // Validating data before inserting into the database
            if (!empty($nome) && !empty($lugares) && !empty($computadores)) {
                // Setting data for insertion
                $dataToInsert = [
                    'nome' => $nome,
                    'lugares' => $lugares,
                    'computadores' => $computadores
                ];

                // Inserting data into the 'Bloco' table
                if ($blocoModel->insert($dataToInsert)) {
---
INSERT INTO `Bloco` (`nome`, `lugares`, `computadores`) VALUES ('Laboratorio 5', '2', '5')